[
  {
    "title": "Rate-Repository-App (React Native App)",
    "linkText": "GitHub",
    "link": "https://github.com/Pulkitxm/rate-repository-app",
    "vidCode": "n-zVYKZX8FA",
    "skills": "React Native, ReactJS, GraphQL, Apollo GraphQL",
    "desc": "🚀 Completed Rate-Repository-App! Built for FullStackOpen course, it enables users to rate GitHub repositories, with one review per user. Features infinite scroll, dedicated views, and authentic feedback. A journey of learning and growth. Check it out!",
    "id": "rate-repo-app"
  },
  {
    "title": "Wanderlust",
    "linkText": "GitHub",
    "link": "https://github.com/Pulkitxm/wanderlust",
    "vidCode": "zQD3Kj95H7w",
    "skills": "MongoDB Atlas, MongoDB, Mongoose, ExpressJS, NodeJS, ReactJS, EJS, Cloudinary",
    "desc": "🚀 Completed Wanderlust during Delta Course. Comprehensive web app featuring user authentication, CRUD operations, category-based filtering, search, star ratings, and Mapbox. Proud of skills honed and product crafted.",
    "id": "wanderlust"
  },
  {
    "title": "BlogKit - the Blogging Application",
    "linkText": "BlogKit",
    "link": "https://blog-kit-pulkit.vercel.app/",
    "vidCode": "zJbR01Rd1F0",
    "skills": "MongoDB Atlas, MongoDB, Mongoose, ExpressJS, NodeJS, ReactJS, EJS",
    "desc": "Excited to share a feature-rich blog application! Create, view, edit, and delete blogs effortlessly. Real-time preview, smooth navigation, and likes. Join the blogging journey and create fantastic content together!",
    "id": "blogkit"
  },
  {
    "title": "Whatsapp Clone",
    "linkText": "GitHub",
    "link": "https://github.com/Pulkitxm/Whatsapp",
    "vidCode": "gdr_j1lzlWU",
    "skills": "MongoDB Atlas, MongoDB, Mongoose, ExpressJS, NodeJS, ReactJS, JWT",
    "desc": "🚀 Completed MERN Stack Project: Real-Time Chat Application! Built with MERN stack, it features user authentication, chat storage, frontend with chat refresh, local storage, and error handling. A creative solution for real-time messaging.",
    "id": "wa-clone"
  }
]
